Revit 2024 API
IExternalResourceServer.SupportsExternalResourceType Method
 Implement this method to indicate whether the server can provide data for a specified type of external resource.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
bool SupportsExternalResourceType(
	ExternalResourceType type
)
Visual Basic
Function SupportsExternalResourceType ( _
	type As ExternalResourceType _
) As Boolean
Visual C++
bool SupportsExternalResourceType(
	ExternalResourceType^ type
)
Parameters
type
Type: Autodesk.Revit.DB.ExternalResourceType
 The ExternalResourceType of interest to the caller. For example, KeynoteTable - to determine if the server provides data for Revit's keynote table.
Return Value
 True if the server supports the specified type of external resource
See Also
IExternalResourceServer Interface
Autodesk.Revit.DB Namespace